# Python useRs

## PyData DC 2016

### Daniel Chen (@chendaniely)

- Virginia Tech
- PhD Student in **G**enetics, **B**ioinformatics, and **C**omputational **B**iology
- **S**ocial and **D**ecision **A**nalytics **L**aboratory
- Biocomplexity Institute of Virginia Tech

- Software-Carpentry: `Programming with R` Lesson Co-Maintainer

# The Python / R Debate

<img src='https://github.com/chendaniely/2016-pydata-dc-python_useRs/raw/master/img/tweet_jake_opensource.png'>

<!-- https://twitter.com/jakevdp/status/778239543594000385 -->

# Datasets

- Ebola (Caitlin Rivers, MPH, PhD):  https://github.com/cmrivers/ebola
- Survey (Software-Carpentry):  http://swcarpentry.github.io/sql-novice-survey/
- Gapminder (Jennifer Bryan, PhD): https://github.com/jennybc/gapminder

# Python

Python's data analytics stack is a little ... different?

James Powell - Integration With the Vernacular the NumPy Approach (PyData Dallas 2015)

https://www.youtube.com/watch?v=u2yvNw49AX4

# How to get it?

## Anaconda!

https://www.continuum.io/downloads

# How to run it?

- `python`
- `ipython`
- `jupyter notebook`
- spyder: https://pythonhosted.org/spyder/
- rodeo: https://www.yhat.com/products/rodeo
- PyCharm: https://www.jetbrains.com/pycharm/

# Using it

In [1]:
import pandas as pd

In [2]:
ebola_df = pd.read_csv('../data/country_timeseries.csv')
ebola_df.head()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,1/5/2015,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,1/4/2015,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,1/3/2015,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,1/2/2015,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,12/31/2014,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN

In [3]:
print(ebola_df.head())

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286           NaN         8157.0                NaN
4  12/31/2014  284        2730.0         8115.0             9633.0

   Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  Cases_Mali  \
0            NaN            NaN                 NaN          NaN         NaN
1            NaN            NaN                 NaN          NaN         NaN
2            NaN            NaN                 NaN          NaN         NaN
3            NaN            NaN                 NaN          NaN         NaN
4            NaN            NaN                 NaN          NaN         NaN

   Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  Deaths_Nigeria  \
0         1786.0             NaN              2977.0             NaN
1         1781.0             NaN              2943.0             NaN
2         1767.0          3496.0              2915.0             NaN
3            NaN          3496.0                 NaN             NaN
4         1739.0          3471.0              2827.0             NaN

   Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  Deaths_Mali
0             NaN                  NaN           NaN          NaN
1             NaN                  NaN           NaN          NaN
2             NaN                  NaN           NaN          NaN
3             NaN                  NaN           NaN          NaN
4             NaN                  NaN           NaN          NaN

In [4]:
ebola_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
Date                   122 non-null object
Day                    122 non-null int64
Cases_Guinea           93 non-null float64
Cases_Liberia          83 non-null float64
Cases_SierraLeone      87 non-null float64
Cases_Nigeria          38 non-null float64
Cases_Senegal          25 non-null float64
Cases_UnitedStates     18 non-null float64
Cases_Spain            16 non-null float64
Cases_Mali             12 non-null float64
Deaths_Guinea          92 non-null float64
Deaths_Liberia         81 non-null float64
Deaths_SierraLeone     87 non-null float64
Deaths_Nigeria         38 non-null float64
Deaths_Senegal         22 non-null float64
Deaths_UnitedStates    18 non-null float64
Deaths_Spain           16 non-null float64
Deaths_Mali            12 non-null float64
dtypes: float64(16), int64(1), object(1)
memory usage: 17.2+ KB

In [5]:
ebola_df.describe()

,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
count,122.000000,93.000000,83.000000,87.000000,38.000000,25.00,18.000000,16.0,12.000000,92.000000,81.000000,87.000000,38.000000,22.0,18.000000,16.000000,12.000000
mean,144.778689,911.064516,2335.337349,2427.367816,16.736842,1.08,3.277778,1.0,3.500000,563.239130,1101.209877,693.701149,6.131579,0.0,0.833333,0.187500,3.166667
std,89.316460,849.108801,2987.966721,3184.803996,5.998577,0.40,1.178511,0.0,2.746899,508.511345,1297.208568,869.947073,2.781901,0.0,0.383482,0.403113,2.405801
min,0.000000,49.000000,3.000000,0.000000,0.000000,1.00,1.000000,1.0,1.000000,29.000000,2.000000,0.000000,0.000000,0.0,0.000000,0.000000,1.000000
25%,66.250000,236.000000,25.500000,64.500000,15.000000,1.00,3.000000,1.0,1.000000,157.750000,12.000000,6.000000,4.000000,0.0,1.000000,0.000000,1.000000
50%,150.000000,495.000000,516.000000,783.000000,20.000000,1.00,4.000000,1.0,2.500000,360.500000,294.000000,334.000000,8.000000,0.0,1.000000,0.000000,2.000000
75%,219.500000,1519.000000,4162.500000,3801.000000,20.000000,1.00,4.000000,1.0,6.250000,847.750000,2413.000000,1176.000000,8.000000,0.0,1.000000,0.000000,6.000000
max,289.000000,2776.000000,8166.000000,10030.000000,22.000000,3.00,4.000000,1.0,7.000000,1786.000000,3496.000000,2977.000000,8.000000,0.0,1.000000,1.000000,6.000000

# Subsetting in Python

In [6]:
ebola_df['Day'].head()

0    289
1    288
2    287
3    286
4    284
Name: Day, dtype: int64

In [7]:
ebola_df.Day.head()

0    289
1    288
2    287
3    286
4    284
Name: Day, dtype: int64

In [8]:
ebola_df[['Day', 'Cases_Guinea']].head()

   Day  Cases_Guinea
0  289        2776.0
1  288        2775.0
2  287        2769.0
3  286           NaN
4  284        2730.0

In [9]:
ebola_df[[0, 1]].head() # 0 indexed

         Date  Day
0    1/5/2015  289
1    1/4/2015  288
2    1/3/2015  287
3    1/2/2015  286
4  12/31/2014  284

In [10]:
ebola_df.loc[0] # by row name

Date                   1/5/2015
Day                         289
Cases_Guinea               2776
Cases_Liberia               NaN
Cases_SierraLeone         10030
Cases_Nigeria               NaN
Cases_Senegal               NaN
Cases_UnitedStates          NaN
Cases_Spain                 NaN
Cases_Mali                  NaN
Deaths_Guinea              1786
Deaths_Liberia              NaN
Deaths_SierraLeone         2977
Deaths_Nigeria              NaN
Deaths_Senegal              NaN
Deaths_UnitedStates         NaN
Deaths_Spain                NaN
Deaths_Mali                 NaN
Name: 0, dtype: object

In [11]:
ebola_df.iloc[0] # by row number

Date                   1/5/2015
Day                         289
Cases_Guinea               2776
Cases_Liberia               NaN
Cases_SierraLeone         10030
Cases_Nigeria               NaN
Cases_Senegal               NaN
Cases_UnitedStates          NaN
Cases_Spain                 NaN
Cases_Mali                  NaN
Deaths_Guinea              1786
Deaths_Liberia              NaN
Deaths_SierraLeone         2977
Deaths_Nigeria              NaN
Deaths_Senegal              NaN
Deaths_UnitedStates         NaN
Deaths_Spain                NaN
Deaths_Mali                 NaN
Name: 0, dtype: object

In [12]:
ebola_df.ix[0] # by name, then number

Date                   1/5/2015
Day                         289
Cases_Guinea               2776
Cases_Liberia               NaN
Cases_SierraLeone         10030
Cases_Nigeria               NaN
Cases_Senegal               NaN
Cases_UnitedStates          NaN
Cases_Spain                 NaN
Cases_Mali                  NaN
Deaths_Guinea              1786
Deaths_Liberia              NaN
Deaths_SierraLeone         2977
Deaths_Nigeria              NaN
Deaths_Senegal              NaN
Deaths_UnitedStates         NaN
Deaths_Spain                NaN
Deaths_Mali                 NaN
Name: 0, dtype: object

In [13]:
ebola_df.ix[[0, 1], [0, 1]] # slicing rows and columns

       Date  Day
0  1/5/2015  289
1  1/4/2015  288

In [14]:
ebola_df.ix[ebola_df.Cases_SierraLeone > 5000, ['Date', 'Cases_SierraLeone']]

          Date  Cases_SierraLeone
0     1/5/2015            10030.0
1     1/4/2015             9780.0
2     1/3/2015             9722.0
4   12/31/2014             9633.0
5   12/28/2014             9446.0
6   12/27/2014             9409.0
7   12/24/2014             9203.0
8   12/21/2014             9004.0
9   12/20/2014             8939.0
11  12/14/2014             8356.0
13   12/7/2014             7897.0
15  11/30/2014             7312.0
17  11/23/2014             6599.0
19  11/18/2014             6190.0
20  11/16/2014             6073.0
22  11/11/2014             5586.0
24   11/9/2014             5368.0
30  10/29/2014             5338.0
31  10/27/2014             5235.0

In [15]:
print(type(ebola_df['Day']))
print(type(ebola_df[['Day', 'Cases_Guinea']]))

print(type(ebola_df['Day'].values))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
<class 'numpy.ndarray'>

# Creating new columns

In [16]:
print(ebola_df.shape)
ebola_df.head()

(122, 18)

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,1/5/2015,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,1/4/2015,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,1/3/2015,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,1/2/2015,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,12/31/2014,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN

In [17]:
ebola_df['some_deaths'] = ebola_df.Deaths_Guinea + \
    ebola_df.Deaths_Liberia

In [18]:
print(ebola_df.shape)
ebola_df.head()

(122, 19)

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali,some_deaths
0,1/5/2015,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN,NaN
1,1/4/2015,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN,NaN
2,1/3/2015,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN,5263.0
3,1/2/2015,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,12/31/2014,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN,5210.0

# Missing Values

Missing values are missing/unknown.

They don't equal anything becuase you don't know what it acually equals.

Which is why missing values don't equal other missing values

In [19]:
from numpy import nan, NAN, NaN

In [20]:
pd.isnull(nan)

True

In [21]:
ebola_df.Cases_Guinea.value_counts(dropna=False).head()

NaN       29
 86.0      3
 495.0     2
 112.0     2
 390.0     2
Name: Cases_Guinea, dtype: int64

# Combining data

In [22]:
c1 = pd.read_csv('../data/concat_1.csv')
c2 = pd.read_csv('../data/concat_2.csv')

In [23]:
c1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [24]:
c2

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [25]:
pd.concat([c1, c2])

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [26]:
pd.concat([c1, c2], axis=1)

    A   B   C   D   A   B   C   D
0  a0  b0  c0  d0  a4  b4  c4  d4
1  a1  b1  c1  d1  a5  b5  c5  d5
2  a2  b2  c2  d2  a6  b6  c6  d6
3  a3  b3  c3  d3  a7  b7  c7  d7

In [27]:
survey_visited = pd.read_csv('../data/survey_visited.csv')
survey_site = pd.read_csv('../data/survey_site.csv')

In [28]:
survey_visited.head()

   ident  site       dated
0    619  DR-1  1927-02-08
1    622  DR-1  1927-02-10
2    734  DR-3  1939-01-07
3    735  DR-3  1930-01-12
4    751  DR-3  1930-02-26

In [29]:
survey_site.head()

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [30]:
survey_visited.merge(survey_site, how='outer', left_on='site', right_on='name')

   ident   site       dated   name    lat    long
0    619   DR-1  1927-02-08   DR-1 -49.85 -128.57
1    622   DR-1  1927-02-10   DR-1 -49.85 -128.57
2    844   DR-1  1932-03-22   DR-1 -49.85 -128.57
3    734   DR-3  1939-01-07   DR-3 -47.15 -126.72
4    735   DR-3  1930-01-12   DR-3 -47.15 -126.72
5    751   DR-3  1930-02-26   DR-3 -47.15 -126.72
6    752   DR-3         NaN   DR-3 -47.15 -126.72
7    837  MSK-4  1932-01-14  MSK-4 -48.87 -123.40

# Vector and grouped operations

In [31]:
gapminder = pd.read_csv('../data/gapminder.tsv', sep='\t')
gapminder.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [32]:
# axis default 0, will go column-wise
gapminder['lifeExpPerCap'] = gapminder.apply(lambda x: x.lifeExp / x['pop'], axis=1)

In [33]:
def calc_life_exp_per_cap(row_of_data):
    # print(row_of_data)
    life_exp_per_cap = row_of_data['lifeExp'] / row_of_data['pop']
    return(life_exp_per_cap)
gapminder['lifeExpPerCap2'] = gapminder.apply(calc_life_exp_per_cap, axis=1)

all(gapminder['lifeExpPerCap'] == gapminder['lifeExpPerCap2'])

True

In [34]:
gapminder.groupby('year')[['lifeExp', 'gdpPercap']].mean()

        lifeExp     gdpPercap
year
1952  49.057620   3725.276046
1957  51.507401   4299.408345
1962  53.609249   4725.812342
1967  55.678290   5483.653047
1972  57.647386   6770.082815
1977  59.570157   7313.166421
1982  61.533197   7518.901673
1987  63.212613   7900.920218
1992  64.160338   8158.608521
1997  65.014676   9090.175363
2002  65.694923   9917.848365
2007  67.007423  11680.071820

# Fit a model

In [37]:
from sklearn import linear_model
reg = linear_model.LinearRegression()
reg.fit (X=gapminder[['lifeExp', 'gdpPercap', 'pop']], y=gapminder.lifeExp.values)
reg.coef_

ImportError: No module named 'sklearn'

# These Slides

- Created in the `jupyter notebook`
- used the RISE package by Damian Avila
    - https://github.com/damianavila/RISE
    - `conda install -c damianavila82 rise`